[
    {
        "title": "Elon Musk Comes Up Short",
        "link": "https://politicalwire.com/2025/04/25/elon-musk-comes-up-short/",
        "content": "“President Trump and Elon Musk promised taxpayers big savings, maybe even a ‘DOGE dividend’ check in their mailboxes, when the Department of Government Efficiency was let loose on the federal government. Now, as he prepares",
        "source": "Politicalwire.com"
    },
    {
        "title": "¿Cuán beneficiosos son realmente los cereales para nuestra salud?",
        "link": "https://www.bbc.com/mundo/articles/cn4w8jdgymyo",
        "content": "Los cereales de desayuno fortificados pueden ser una fuente útil de fibra, vitaminas y minerales, pero algunos se consideran alimentos ultraprocesados.",
        "source": "BBC News"
    },
    {
        "title": "Serviciul de securitate al Rusiei susține că a reținut un român care spiona pentru Ucraina și a publicat imagini cu momentul arestării. Îl acuză că transmitea informații despre instalațiile de apărare aeriană din orașul Soci, din Krasnodar.",
        "link": "https://www.biziday.ro/317427-2/",
        "content": "‼️ A #Romanian citizen who was collecting information about the deployment of #Russian air defense systems on assignment from Kiev has been detained in Sochi, the FSB reported. pic.twitter.com/mVAlJ6RgIM — Maimunka News (@MaimunkaNews) April 25, 2025 …",
        "source": "Biziday.ro"
    },
    {
        "title": "Tesla stock: are volume and sentiment bottoming together?",
        "link": "https://biztoc.com/x/0a520b5693784128",
        "content": "The Entire Business World on a Single Page with the Web's Most Comprehensive One-Stop Finance News Hub.",
        "source": "Biztoc.com"
    },
    {
        "title": "Szalenie ważne dni dla Wisły Kraków. Wiele się wyjaśni",
        "link": "https://sport.interia.pl/pilka-nozna/1-liga/news-szalenie-wazne-dni-dla-wisly-krakow-wiele-sie-wyjasni,nId,7954931",
        "content": "Wisła Kraków rozpoczyna serię kluczowych spotkań. Jeśli podtrzyma passę zwycięstw, zbliży się do Ekstraklasy. Z kolei straty punktów mogą okazać się bardzo bolesne. Dziś pierwszy z meczów - na wyjeździe z wiceliderem Bruk-Bet Termalica Nieciecza (godz. 20:30).",
        "source": "Interia.pl"
    },
    {
        "title": "Penn Badgley shares why he dropped ‘no sex scenes’ clause for final season of You: ‘Had to return to form’",
        "link": "https://www.the-independent.com/arts-entertainment/tv/news/penn-badgley-dropped-no-sex-scenes-clause-final-season-you-b2739328.html",
        "content": "Actor previously said he had requested a reduction in number of sex scenes",
        "source": "The-independent.com"
    },
    {
        "title": "Premier League injury news, predicted lineups, fantasy updates",
        "link": "https://www.espn.com/soccer/story/_/id/44848083/premier-league-injury-news-chelsea-man-united-liverpool-predicted-xis",
        "content": "Find out who is missing through injury and who is in a race against time to prove their fitness in the Premier League this weekend.",
        "source": "ESPN"
    },
    {
        "title": "Apple's new iPhone 16 ad encourages you to go case-free – here’s why that’s still a bad idea",
        "link": "https://www.techradar.com/phones/iphone/apples-new-iphone-16-ad-encourages-you-to-go-case-free-heres-why-thats-still-a-bad-idea",
        "content": "Apple's latest promo ad shows an iPhone 16 being dropped to the floor, but surviving without a scratch.",
        "source": "TechRadar"
    },
    {
        "title": "What is VE day and how will the King and Queen celebrate it?",
        "link": "https://www.the-independent.com/news/uk/home-news/ve-day-king-charles-queen-camilla-victory-europe-b2739364.html",
        "content": "VE day events will start on Bank Holiday Monday with a procession of 1,300 members of the Armed Forces",
        "source": "The-independent.com"
    },
    {
        "title": "Wybuch tuż pod Moskwą. Media: Nie żyje rosyjski generał",
        "link": "https://wydarzenia.interia.pl/zagranica/news-wybuch-tuz-pod-moskwa-media-nie-zyje-rosyjski-general,nId,21397739",
        "content": "Zastępca szefa Głównego Zarządu Operacyjnego Sztabu Generalnego Sił Zbrojnych Rosji gen. Jarosław Moskalik nie żyje - podają media. Wojskowy miał zginąć w eksplozji zaparkowanego na podwórzu samochodu w mieście Bałaszycha, w obwodzie moskiewskim. Nieoficjalne…",
        "source": "Interia.pl"
    },
    {
        "title": "Ousted Russian general",
        "link": "https://edition.cnn.com/2025/04/15/europe/ousted-russian-general-ivan-popov-return-intl/index.html",
        "content": "One of Russia’s most outspoken generals, sacked and detained after a withering attack on the Defense Ministry two years ago, is returning to the front, according to his lawyer. But according to Russian state media, he’s been handed a poisoned chalice: front-line command of a notorious battalion of ex-prisoners that has suffered massive casualties in Ukraine. Two years ago, Major General Ivan Popov was the decorated commander of the 58th Combined Arms Army in southern Ukraine, receiving plaudits ",
        "source": "CNN"
    },
    {
        "title": "‘Historic’ WHO agreement",
        "link": "https://edition.cnn.com/2025/04/15/health/world-health-organization-pandemic-agreement-intl-hnk/index.html",
        "content": "Members of the World Health Organization reached an agreement to prepare the world for future pandemics after more than three years of negotiations, the organization said early on Wednesday. The legally binding pact is intended to shore up the world’s defenses against new pathogens after the COVID-19 pandemic killed millions of people in 2020-22. The proposal outlines measures to prevent future pandemics and strengthen global collaboration. This includes establishing a pathogen access and benefi",
        "source": "CNN"
    },
    {
        "title": "Pakistan and India heatwaves",
        "link": "https://edition.cnn.com/2025/04/15/asia/india-pakistan-heatwave-climate-crisis-intl-hnk/index.html",
        "content": "For hundreds of millions of people living in India and Pakistan the early arrival of summer heatwaves has become a terrifying reality that’s testing survivability limits and putting enormous strain on energy supplies, vital crops and livelihoods. Both countries experience heatwaves during the summer months of May and June, but this year’s heatwave season has arrived sooner than usual and is predicted to last longer too. Temperatures are expected to climb to dangerous levels in both countries thi",
        "source": "CNN"
    },
    {
        "title": "UNESCO Global Geopark",
        "link": "https://edition.cnn.com/2025/04/15/travel/north-korea-mount-paektu-unesco-geopark-intl-hnk/index.html",
        "content": "High atop the Korean Peninsula, past military checkpoints and bumpy dirt roads in one of the world’s most secretive countries, rises a volcano and deep crater lake steeped in symbolism. Mount Paektu, an active stratovolcano straddling the border of North Korea and China, is the highest peak on the Korean peninsula and lies at the heart of North Korea’s foundation myth. The North Korean side of the mountain was recently designated a UNESCO Global Geopark, marking North Korea’s first natural site ",
        "source": "CNN"
    },
    {
        "title": "World’s tallest bridge",
        "link": "https://edition.cnn.com/2025/04/15/travel/huajiang-grand-canyon-bridge-china-intl-hnk/index.html",
        "content": "Move over, Golden Gate and Sydney Harbour. China is set to open the world’s tallest bridge in June, the latest feat of engineering from the infrastructure-focused country. The Huajiang Grand Canyon Bridge is currently nearing the end of construction in Guizhou, southwest China. It will measure 2,051 feet above river level, which is 947 feet taller than current bridge title holder the Millau Viaduct in France. Guizhou province is a mountainous areas of China, with complex terrain. The bridge cros",
        "source": "CNN"
    },
    {
        "title": "Lenny Kravitz’s mansion",
        "link": "https://edition.cnn.com/2025/04/15/style/lenny-kravitz-paris-home-architectural-digest/index.html",
        "content": "There are a few constants that the Internet knows about Lenny Kravitz’s lifestyle. Photos of him wearing an enormous brown blanket scarf, which resurface each year, have become a reliable indicator of the approaching winter. And he’s never far from a pair of leather pants, which the 60-year-old American musician proved last year when he posted a video to TikTok bench pressing while doing sit-ups at the gym in black leather, a sheer mesh tank and sunglasses. (“This isn’t how everyone’s dad works ",
        "source": "CNN"
    },
    {
        "title": "Xi’s powerful card in fight against Trump’s trade war",
        "link": "https://edition.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Less than a year into Donald Trump’s first trade war with China, Chinese leader Xi Jinping made a high-profile visit to an unassuming factory in Ganzhou, an industrial city nestled among rolling hills in the country’s southeast. Touring its exhibition hall in 2019, Xi examined row upon row of unremarkable gray metal blocks and declared to his entourage of Communist Party officials: “Rare earths are a vital strategic resource.” Nearly six years on, Ch",
        "source": "CNN"
    },
    {
        "title": "China’s export restrictions on seven types of rare earth minerals is bad news for America’s cutting edge industries. And Trump has little room to retaliate in kind.",
        "link": "https://edition.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Less than a year into Donald Trump’s first trade war with China, Chinese leader Xi Jinping made a high-profile visit to an unassuming factory in Ganzhou, an industrial city nestled among rolling hills in the country’s southeast. Touring its exhibition hall in 2019, Xi examined row upon row of unremarkable gray metal blocks and declared to his entourage of Communist Party officials: “Rare earths are a vital strategic resource.” Nearly six years on, Ch",
        "source": "CNN"
    },
    {
        "title": "Hong Kong suspends postal service to the US after Trump’s tariff hikes",
        "link": "https://edition.cnn.com/2025/04/15/business/hong-kong-suspends-postal-service-to-us-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Hong Kong’s postal service will stop handling packages coming from or going to the United States, in the latest retaliatory move amid an escalating trade war between Washington and Beijing. In a statement published Wednesday announcing the decision, the government of Hong Kong cited US President Donald Trump’s decision last week to eliminate the so-called de minimis exception for items posted from the city to the US. The exemption applied to internat",
        "source": "CNN"
    },
    {
        "title": "Trump’s trade war is wrecking America’s brand value, from Teslas to Treasuries",
        "link": "https://edition.cnn.com/2025/04/16/business/america-brand-trade-war/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Editor’s Note: A version of this story appeared in CNN Business’ Nightcap newsletter. To get it in your inbox, sign up for free here. This is all pretty embarrassing. It’s been two weeks since President Donald Trump’s “Liberation Day” tariff speech launched a global trade war, premised on absurd math, and erased trillions of dollars in market value. Every day since has been a stream of contradictory statements and brinkmanship with no way of knowing ",
        "source": "CNN"
    },
    {
        "title": "Showing Up and Showing Out",
        "link": "https://www.portlandmercury.com/city-guide-2025/2025/04/24/47753845/showing-up-and-showing-out",
        "content": "The many ways Portland’s queer and trans people take care of each other.\n \n by Blair Stenvick\n \n \n \n I’ve lived in Portland as an out queer person for more than a decade now, and the longer I live here, the more in awe I am of the way Portland queers show up,…",
        "source": "The Portland Mercury"
    },
    {
        "title": "$1M to tackle health inequity in St. Petersburg. Can it make a difference?",
        "link": "https://www.tampabay.com/news/health/2025/04/24/1m-tackle-health-inequity-st-petersburg-can-it-make-difference/",
        "content": "The Foundation for a Healthy St. Pete grants are intended to draw nonprofits to address health issues highlighted in a recent study.",
        "source": "Tampa Bay Times"
    },
    {
        "title": "Cine este „Yoko Ono de la Pentagon”, în care are încredere totală secretarul Apărării. Pete Hegseth „e în paranoia totală”",
        "link": "https://www.digi24.ro/stiri/externe/cine-este-yoko-ono-de-la-pentagon-in-care-are-incredere-totala-secretarul-apararii-pete-hegseth-e-in-paranoia-totala-3212067",
        "content": "Secretarul american al Apărării, Pete Hegseth, este în „paranoia totală” și are încredere doar în soția sa și în cercul său intim, în urma unei serii de scurgeri de informații de la Pentagon, relatează, citând surse bine informate, cotidianul britanic The Tel…",
        "source": "Digi24.ro"
    },
    {
        "title": "Morte di Papa Francesco, allarme sicurezza: attacchi informatici in aumento",
        "link": "https://www.hdblog.it/sicurezza/articoli/n616254/morte-papa-francesco-attacchi-informatici/",
        "content": "Contenuti manipolati e curiosità virale: il ciclo prevedibile degli attacchi informatici legati a eventi globali",
        "source": "Hdblog.it"
    },
    {
        "title": "Ayurveda-Experte Dr. Ulrich Bauhofer: Jung altern, aber wie? Das hilft wirklich",
        "link": "https://www.brigitte.de/aktuell/ayurveda-experte-dr--ulrich-bauhofer--jung-altern--aber-wie--das-hilft-wirklich-13979618.html",
        "content": "Die kleinen Dinge im Alltag sind entscheidend für ein gesundes Altern. Ayurveda-Experte Dr. Ulrich Bauhofer erklärt, wie es geht.",
        "source": "Brigitte.de"
    },
    {
        "title": "Hegseth postavil v Pentagonu „šminkovací místnost“, demokraté se mu vysmáli",
        "link": "https://www.idnes.cz/zpravy/zahranicni/hegseth-pentagon-make-up-mistnost.A250424_094500_zahranicni_ert",
        "content": "Demokraté se bouří a hromosvodem jejich hněvu je, jak už to v posledních měsících bývá, Pete Hegseth. Výjimečně nejde o vyzrazení přísně tajných informací, ale o téma krásy. Ministr obrany totiž nechal přestavět jednu kancelář v Pentagonu na takzvanou šminkov…",
        "source": "Idnes.cz"
    },
    {
        "title": "Lennox just upgraded at Oppenheimer, here's why",
        "link": "https://thefly.com/permalinks/entry.php/id4112539/LII-Lennox-just-upgraded-at-Oppenheimer-heres-why",
        "content": "See the rest of the story here.\n\nthefly.com provides the latest financial news as it breaks. Known as a leader in market intelligence, The Fly's real-time, streaming news feed keeps individual investors, professional money managers, active traders, and corpor…",
        "source": "Thefly.com"
    },
    {
        "title": "Zwischenwahlkampf im Landtag",
        "link": "https://kaernten.orf.at/stories/3302495/",
        "content": "Noch etwas mehr als 1.000 Tage sind es bis zum nächsten regulären Landtagswahltermin in Kärnten. In der Landtagssitzung am Donnerstag entwickelte sich die Debatte zur Aktuellen Stunde dennoch bereits zu einer Art Zwischenwahlkampf. Auf Antrag des Team Kärnten…",
        "source": "Kaernten.orf.at"
    },
    {
        "title": "OPINION: Do all opinions deserve a fair hearing? A Jewish approach",
        "link": "https://www.jewishnews.co.uk/opinion-do-all-opinions-deserve-a-fair-hearing-a-jewish-approach/",
        "content": "Some people are impossible to engage with because of the way they disagree, writes Daniel Taub",
        "source": "Jewishnews.co.uk"
    },
    {
        "title": "I’ve Had It host Jennifer Welch tears into Democrat for ‘selling out’ trans people",
        "link": "https://www.thepinknews.com/2025/04/24/ive-had-it-host-jennifer-welch-tears-into-democrat-for-selling-out-trans-people/",
        "content": "Podcast host Jennifer Welch has laid into a veteran US Democrat for “selling out” trans people. The exchange took place on Tuesday’s (22 April) episode of the I’ve Had It. Welch and her husband Josh, who was sitting in for usual co-host Angie “Pumps” Sullivan…",
        "source": "Thepinknews.com"
    },
    {
        "title": "Ousted Russian general",
        "link": "https://edition.cnn.com/2025/04/15/europe/ousted-russian-general-ivan-popov-return-intl/index.html",
        "content": "One of Russia’s most outspoken generals, sacked and detained after a withering attack on the Defense Ministry two years ago, is returning to the front, according to his lawyer. But according to Russian state media, he’s been handed a poisoned chalice: front-line command of a notorious battalion of ex-prisoners that has suffered massive casualties in Ukraine. Two years ago, Major General Ivan Popov was the decorated commander of the 58th Combined Arms Army in southern Ukraine, receiving plaudits ",
        "source": "CNN"
    },
    {
        "title": "‘Historic’ WHO agreement",
        "link": "https://edition.cnn.com/2025/04/15/health/world-health-organization-pandemic-agreement-intl-hnk/index.html",
        "content": "Members of the World Health Organization reached an agreement to prepare the world for future pandemics after more than three years of negotiations, the organization said early on Wednesday. The legally binding pact is intended to shore up the world’s defenses against new pathogens after the COVID-19 pandemic killed millions of people in 2020-22. The proposal outlines measures to prevent future pandemics and strengthen global collaboration. This includes establishing a pathogen access and benefi",
        "source": "CNN"
    },
    {
        "title": "Pakistan and India heatwaves",
        "link": "https://edition.cnn.com/2025/04/15/asia/india-pakistan-heatwave-climate-crisis-intl-hnk/index.html",
        "content": "For hundreds of millions of people living in India and Pakistan the early arrival of summer heatwaves has become a terrifying reality that’s testing survivability limits and putting enormous strain on energy supplies, vital crops and livelihoods. Both countries experience heatwaves during the summer months of May and June, but this year’s heatwave season has arrived sooner than usual and is predicted to last longer too. Temperatures are expected to climb to dangerous levels in both countries thi",
        "source": "CNN"
    },
    {
        "title": "UNESCO Global Geopark",
        "link": "https://edition.cnn.com/2025/04/15/travel/north-korea-mount-paektu-unesco-geopark-intl-hnk/index.html",
        "content": "High atop the Korean Peninsula, past military checkpoints and bumpy dirt roads in one of the world’s most secretive countries, rises a volcano and deep crater lake steeped in symbolism. Mount Paektu, an active stratovolcano straddling the border of North Korea and China, is the highest peak on the Korean peninsula and lies at the heart of North Korea’s foundation myth. The North Korean side of the mountain was recently designated a UNESCO Global Geopark, marking North Korea’s first natural site ",
        "source": "CNN"
    },
    {
        "title": "World’s tallest bridge",
        "link": "https://edition.cnn.com/2025/04/15/travel/huajiang-grand-canyon-bridge-china-intl-hnk/index.html",
        "content": "Move over, Golden Gate and Sydney Harbour. China is set to open the world’s tallest bridge in June, the latest feat of engineering from the infrastructure-focused country. The Huajiang Grand Canyon Bridge is currently nearing the end of construction in Guizhou, southwest China. It will measure 2,051 feet above river level, which is 947 feet taller than current bridge title holder the Millau Viaduct in France. Guizhou province is a mountainous areas of China, with complex terrain. The bridge cros",
        "source": "CNN"
    },
    {
        "title": "Lenny Kravitz’s mansion",
        "link": "https://edition.cnn.com/2025/04/15/style/lenny-kravitz-paris-home-architectural-digest/index.html",
        "content": "There are a few constants that the Internet knows about Lenny Kravitz’s lifestyle. Photos of him wearing an enormous brown blanket scarf, which resurface each year, have become a reliable indicator of the approaching winter. And he’s never far from a pair of leather pants, which the 60-year-old American musician proved last year when he posted a video to TikTok bench pressing while doing sit-ups at the gym in black leather, a sheer mesh tank and sunglasses. (“This isn’t how everyone’s dad works ",
        "source": "CNN"
    },
    {
        "title": "Xi’s powerful card in fight against Trump’s trade war",
        "link": "https://edition.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Less than a year into Donald Trump’s first trade war with China, Chinese leader Xi Jinping made a high-profile visit to an unassuming factory in Ganzhou, an industrial city nestled among rolling hills in the country’s southeast. Touring its exhibition hall in 2019, Xi examined row upon row of unremarkable gray metal blocks and declared to his entourage of Communist Party officials: “Rare earths are a vital strategic resource.” Nearly six years on, Ch",
        "source": "CNN"
    },
    {
        "title": "China’s export restrictions on seven types of rare earth minerals is bad news for America’s cutting edge industries. And Trump has little room to retaliate in kind.",
        "link": "https://edition.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Less than a year into Donald Trump’s first trade war with China, Chinese leader Xi Jinping made a high-profile visit to an unassuming factory in Ganzhou, an industrial city nestled among rolling hills in the country’s southeast. Touring its exhibition hall in 2019, Xi examined row upon row of unremarkable gray metal blocks and declared to his entourage of Communist Party officials: “Rare earths are a vital strategic resource.” Nearly six years on, Ch",
        "source": "CNN"
    },
    {
        "title": "Hong Kong suspends postal service to the US after Trump’s tariff hikes",
        "link": "https://edition.cnn.com/2025/04/15/business/hong-kong-suspends-postal-service-to-us-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Hong Kong’s postal service will stop handling packages coming from or going to the United States, in the latest retaliatory move amid an escalating trade war between Washington and Beijing. In a statement published Wednesday announcing the decision, the government of Hong Kong cited US President Donald Trump’s decision last week to eliminate the so-called de minimis exception for items posted from the city to the US. The exemption applied to internat",
        "source": "CNN"
    },
    {
        "title": "Trump’s trade war is wrecking America’s brand value, from Teslas to Treasuries",
        "link": "https://edition.cnn.com/2025/04/16/business/america-brand-trade-war/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Editor’s Note: A version of this story appeared in CNN Business’ Nightcap newsletter. To get it in your inbox, sign up for free here. This is all pretty embarrassing. It’s been two weeks since President Donald Trump’s “Liberation Day” tariff speech launched a global trade war, premised on absurd math, and erased trillions of dollars in market value. Every day since has been a stream of contradictory statements and brinkmanship with no way of knowing ",
        "source": "CNN"
    },
    {
        "title": "Dead rodents found on Gene Hackman’s property by health department investigators",
        "link": "https://www.wbrc.com/2025/04/15/dead-rodents-found-gene-hackmans-property-by-health-department-investigators/",
        "content": "Hackman's wife died from hantavirus, a rare disease caused by exposure to rodents, before her husband died, according to a medical examiner's report.",
        "source": "WBRC"
    },
    {
        "title": "Trump különmegbízottja szerint „már alakul” az orosz-ukrán béke",
        "link": "https://hvg.hu/vilag/20250415_Trump-kulonmegbizottja-szerint-mar-alakul-az-orosz-ukran-beke",
        "content": "Steve Witkoff a múlt héten öt órán át tárgyalt Putyinnal, most elmondott pár dolgot a találkozóról.",
        "source": "Hvg.hu"
    },
    {
        "title": "Call of Duty 2025: Wenn dieses Feature zurückkommt, kaufe ich den Shooter zum Release",
        "link": "https://www.giga.de/entertainment/call-of-duty-2025-wenn-dieses-feature-zurueckkommt-kaufe-ich-den-shooter-zum-release--01JRWFSG5VDAXF4FHD8YCKM27H",
        "content": "Erste Gerüchte zum diesjährigen Call of Duty machen die Runde im Netz. Darunter befindet sich auch ein Feature, das ich schmerzlich vermisse: eine Koop-Kampagne. Sollte diese Mechanik dieses Jahr tatsächlich ein Comeback feiern, dann wäre ich direkt zum Relea…",
        "source": "Giga"
    },
    {
        "title": "JD Vance trolled with jokes that Trump’s tariffs ‘will lead to the soaring price of eyeliner’",
        "link": "https://www.thepinknews.com/2025/04/15/jd-vance-eyeliner-tariffs-donald-trump/",
        "content": "Vice-president JD Vance has once again become the butt of jokes over his alleged use of eyeliner, and this time its related to the thorny issue of Trump’s controversial tariffs. Now, we don’t take issue with anyone for their apparent use of make up, but if yo…",
        "source": "Thepinknews.com"
    },
    {
        "title": "Mr. Drew and His Animals, Too searching for new location. Again.",
        "link": "https://www.sunjournal.com/2025/04/14/mr-drew-and-his-animals-too-searching-for-new-location-again/",
        "content": "Drew Desjardins, owner of the business, announced Monday that he has been told that he needs to leave his spacious spot at the Lewiston Mall by the end of July.",
        "source": "Lewiston Sun Journal"
    },
    {
        "title": "Integration Tests for Plugin Developers: GitHub Actions and Setting Up Continuous Integration",
        "link": "https://blog.jetbrains.com/platform/2025/04/integration-tests-for-plugin-developers-github-actions-and-setting-up-continuous-integration/",
        "content": "In our previous blog posts, we created integration tests that interact with UI components, assert different properties of UI components, and interact with APIs. Now, it’s time to look at how to set up continuous integration to ensure that we don’t break them …",
        "source": "Jetbrains.com"
    },
    {
        "title": "Taste Atlas: Δύο ελληνικές σαλάτες οι καλύτερες στον κόσμο",
        "link": "https://www.skai.gr/news/gastronomy/taste-atlas-dyo-ellinikes-salates-oi-kalyteres-ston-kosmo",
        "content": "Στη δεύτερη θέση δεν θα μπορούσε να είναι άλλη σαλάτα εκτός από τη χωριάτικη - Στην 50άδα είναι και τα χόρτα αλλά και η πατατοσαλάτα",
        "source": "Skai.gr"
    },
    {
        "title": "‘The Race’ rapper Tay-K convicted of murder for the second time",
        "link": "https://nypost.com/2025/04/15/us-news/rapper-tay-k-convicted-of-murder-for-shooting-photographer-while-fleeing-another-murder/",
        "content": "The rapper is best known for his hit track \"The Race,\" which has amassed hundreds of millions of streams since its release in 2017.",
        "source": "New York Post"
    },
    {
        "title": "‘Just So F*cking Weird!’ Jon Stewart Rips Trump’s ‘Embarrassingly Sycophantic’ Cabinet Members",
        "link": "https://www.mediaite.com/tv/just-so-fcking-weird-jon-stewart-rips-trumps-embarrassingly-sycophantic-cabinet-members/",
        "content": "The Daily Show host Jon Stewart ridiculed President Donald Trump's \"sycophantic\" cabinet members, calling their constant compliments \"just so f*cking weird.\"\nThe post ‘Just So F*cking Weird!’ Jon Stewart Rips Trump’s ‘Embarrassingly Sycophantic’ Cabinet Membe…",
        "source": "Mediaite"
    },
    {
        "title": "Stanley Cup playoff watch: Your guide to the 10 games on Tuesday's schedule",
        "link": "https://www.espn.com/nhl/story/_/id/44673023/nhl-playoffs-bracket-standings-2025-wild-card-bracket-games-matchups",
        "content": "Here's what is at stake in each matchup, with playoff seeding and draft lottery position on the line.",
        "source": "ESPN"
    },
    {
        "title": "Ousted Russian general",
        "link": "https://edition.cnn.com/2025/04/15/europe/ousted-russian-general-ivan-popov-return-intl/index.html",
        "content": "One of Russia’s most outspoken generals, sacked and detained after a withering attack on the Defense Ministry two years ago, is returning to the front, according to his lawyer. But according to Russian state media, he’s been handed a poisoned chalice: front-line command of a notorious battalion of ex-prisoners that has suffered massive casualties in Ukraine. Two years ago, Major General Ivan Popov was the decorated commander of the 58th Combined Arms Army in southern Ukraine, receiving plaudits ",
        "source": "CNN"
    },
    {
        "title": "‘Historic’ WHO agreement",
        "link": "https://edition.cnn.com/2025/04/15/health/world-health-organization-pandemic-agreement-intl-hnk/index.html",
        "content": "Members of the World Health Organization reached an agreement to prepare the world for future pandemics after more than three years of negotiations, the organization said early on Wednesday. The legally binding pact is intended to shore up the world’s defenses against new pathogens after the COVID-19 pandemic killed millions of people in 2020-22. The proposal outlines measures to prevent future pandemics and strengthen global collaboration. This includes establishing a pathogen access and benefi",
        "source": "CNN"
    },
    {
        "title": "Pakistan and India heatwaves",
        "link": "https://edition.cnn.com/2025/04/15/asia/india-pakistan-heatwave-climate-crisis-intl-hnk/index.html",
        "content": "For hundreds of millions of people living in India and Pakistan the early arrival of summer heatwaves has become a terrifying reality that’s testing survivability limits and putting enormous strain on energy supplies, vital crops and livelihoods. Both countries experience heatwaves during the summer months of May and June, but this year’s heatwave season has arrived sooner than usual and is predicted to last longer too. Temperatures are expected to climb to dangerous levels in both countries thi",
        "source": "CNN"
    },
    {
        "title": "UNESCO Global Geopark",
        "link": "https://edition.cnn.com/2025/04/15/travel/north-korea-mount-paektu-unesco-geopark-intl-hnk/index.html",
        "content": "High atop the Korean Peninsula, past military checkpoints and bumpy dirt roads in one of the world’s most secretive countries, rises a volcano and deep crater lake steeped in symbolism. Mount Paektu, an active stratovolcano straddling the border of North Korea and China, is the highest peak on the Korean peninsula and lies at the heart of North Korea’s foundation myth. The North Korean side of the mountain was recently designated a UNESCO Global Geopark, marking North Korea’s first natural site ",
        "source": "CNN"
    },
    {
        "title": "World’s tallest bridge",
        "link": "https://edition.cnn.com/2025/04/15/travel/huajiang-grand-canyon-bridge-china-intl-hnk/index.html",
        "content": "Move over, Golden Gate and Sydney Harbour. China is set to open the world’s tallest bridge in June, the latest feat of engineering from the infrastructure-focused country. The Huajiang Grand Canyon Bridge is currently nearing the end of construction in Guizhou, southwest China. It will measure 2,051 feet above river level, which is 947 feet taller than current bridge title holder the Millau Viaduct in France. Guizhou province is a mountainous areas of China, with complex terrain. The bridge cros",
        "source": "CNN"
    },
    {
        "title": "Lenny Kravitz’s mansion",
        "link": "https://edition.cnn.com/2025/04/15/style/lenny-kravitz-paris-home-architectural-digest/index.html",
        "content": "There are a few constants that the Internet knows about Lenny Kravitz’s lifestyle. Photos of him wearing an enormous brown blanket scarf, which resurface each year, have become a reliable indicator of the approaching winter. And he’s never far from a pair of leather pants, which the 60-year-old American musician proved last year when he posted a video to TikTok bench pressing while doing sit-ups at the gym in black leather, a sheer mesh tank and sunglasses. (“This isn’t how everyone’s dad works ",
        "source": "CNN"
    },
    {
        "title": "Xi’s powerful card in fight against Trump’s trade war",
        "link": "https://edition.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Less than a year into Donald Trump’s first trade war with China, Chinese leader Xi Jinping made a high-profile visit to an unassuming factory in Ganzhou, an industrial city nestled among rolling hills in the country’s southeast. Touring its exhibition hall in 2019, Xi examined row upon row of unremarkable gray metal blocks and declared to his entourage of Communist Party officials: “Rare earths are a vital strategic resource.” Nearly six years on, Ch",
        "source": "CNN"
    },
    {
        "title": "China’s export restrictions on seven types of rare earth minerals is bad news for America’s cutting edge industries. And Trump has little room to retaliate in kind.",
        "link": "https://edition.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Less than a year into Donald Trump’s first trade war with China, Chinese leader Xi Jinping made a high-profile visit to an unassuming factory in Ganzhou, an industrial city nestled among rolling hills in the country’s southeast. Touring its exhibition hall in 2019, Xi examined row upon row of unremarkable gray metal blocks and declared to his entourage of Communist Party officials: “Rare earths are a vital strategic resource.” Nearly six years on, Ch",
        "source": "CNN"
    },
    {
        "title": "Hong Kong suspends postal service to the US after Trump’s tariff hikes",
        "link": "https://edition.cnn.com/2025/04/15/business/hong-kong-suspends-postal-service-to-us-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Hong Kong’s postal service will stop handling packages coming from or going to the United States, in the latest retaliatory move amid an escalating trade war between Washington and Beijing. In a statement published Wednesday announcing the decision, the government of Hong Kong cited US President Donald Trump’s decision last week to eliminate the so-called de minimis exception for items posted from the city to the US. The exemption applied to internat",
        "source": "CNN"
    },
    {
        "title": "Trump’s trade war is wrecking America’s brand value, from Teslas to Treasuries",
        "link": "https://edition.cnn.com/2025/04/16/business/america-brand-trade-war/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Editor’s Note: A version of this story appeared in CNN Business’ Nightcap newsletter. To get it in your inbox, sign up for free here. This is all pretty embarrassing. It’s been two weeks since President Donald Trump’s “Liberation Day” tariff speech launched a global trade war, premised on absurd math, and erased trillions of dollars in market value. Every day since has been a stream of contradictory statements and brinkmanship with no way of knowing ",
        "source": "CNN"
    },
    {
        "title": "Ishmael: Chapter 6",
        "link": "https://www.resilience.org/stories/2025-04-15/ishmael-chapter-6/",
        "content": "Just as gravity keeps the Earth, solar system, and galaxy together/organized, so too does the Law of Life keep the community of life together.",
        "source": "Resilience"
    },
    {
        "title": "Daredevil Fans Think Born Again Finale Will Set Up Major Character’s Return",
        "link": "https://www.comingsoon.net/tv/news/1956498-daredevil-born-again-finale-foggy-alive-return-theory",
        "content": "Daredevil: Born Again‘s finale is fast approaching, and fans believe that they just might see the return of Elden Henson’s Foggy Nelson in Season 1’s ultimate episode. The Disney+ series picked up right where the Charlie Cox-led Netflix show ended, with Matt …",
        "source": "ComingSoon.net"
    },
    {
        "title": "Manjaro Linux 25 now available for download",
        "link": "https://betanews.com/2025/04/15/manjaro-25-zetar-linux-release-gnome-plasma-xfce/",
        "content": "Great news, folks -- the developers of Manjaro have officially launched version 25 of the popular Linux distribution. Codenamed “Zetar,” this release delivers updated desktop environments, new features aimed at improving performance and usability, and expande…",
        "source": "BetaNews"
    },
    {
        "title": "Δεν ξεχνά τον ΠΑΟΚ ο Κέβιν Πόρτερ: «Πάμε να πάρουμε το Ευρωπαϊκό» - Δείτε βίντεο",
        "link": "https://www.skai.gr/news/sports/paok-kevin-porter-pame-na-paroume-to-eyropaiko",
        "content": "Οι ευχές του Κέβιν Πόρτερ Τζούνιορ στον ΠΑΟΚ για την κατάκτηση του FIBA Europe Cup - Ο Αμερικανός γκαρντ δεν ξέχασε την ομάδα από τη Θεσσαλονίκη",
        "source": "Skai.gr"
    },
    {
        "title": "Man left with ‘severe’ facial injuries after being beaten by gang in ‘cowardly’ homophobic attack",
        "link": "https://www.thepinknews.com/2025/04/15/old-bridge-inn-norridge-bottom-yorkshire-homophobic-hate-crime/",
        "content": "A man has been left with injuries that required hospital treatment, after what has been described as a cowardly homophobic attack outside a pub in West Yorkshire.  The victim, in his mid-twenties, was confronted by a gang of at least five men outside the Old …",
        "source": "Thepinknews.com"
    },
    {
        "title": "Ousted Russian general",
        "link": "https://edition.cnn.com/2025/04/15/europe/ousted-russian-general-ivan-popov-return-intl/index.html",
        "content": "One of Russia’s most outspoken generals, sacked and detained after a withering attack on the Defense Ministry two years ago, is returning to the front, according to his lawyer. But according to Russian state media, he’s been handed a poisoned chalice: front-line command of a notorious battalion of ex-prisoners that has suffered massive casualties in Ukraine. Two years ago, Major General Ivan Popov was the decorated commander of the 58th Combined Arms Army in southern Ukraine, receiving plaudits ",
        "source": "CNN"
    },
    {
        "title": "‘Historic’ WHO agreement",
        "link": "https://edition.cnn.com/2025/04/15/health/world-health-organization-pandemic-agreement-intl-hnk/index.html",
        "content": "Members of the World Health Organization reached an agreement to prepare the world for future pandemics after more than three years of negotiations, the organization said early on Wednesday. The legally binding pact is intended to shore up the world’s defenses against new pathogens after the COVID-19 pandemic killed millions of people in 2020-22. The proposal outlines measures to prevent future pandemics and strengthen global collaboration. This includes establishing a pathogen access and benefi",
        "source": "CNN"
    },
    {
        "title": "Pakistan and India heatwaves",
        "link": "https://edition.cnn.com/2025/04/15/asia/india-pakistan-heatwave-climate-crisis-intl-hnk/index.html",
        "content": "For hundreds of millions of people living in India and Pakistan the early arrival of summer heatwaves has become a terrifying reality that’s testing survivability limits and putting enormous strain on energy supplies, vital crops and livelihoods. Both countries experience heatwaves during the summer months of May and June, but this year’s heatwave season has arrived sooner than usual and is predicted to last longer too. Temperatures are expected to climb to dangerous levels in both countries thi",
        "source": "CNN"
    },
    {
        "title": "UNESCO Global Geopark",
        "link": "https://edition.cnn.com/2025/04/15/travel/north-korea-mount-paektu-unesco-geopark-intl-hnk/index.html",
        "content": "High atop the Korean Peninsula, past military checkpoints and bumpy dirt roads in one of the world’s most secretive countries, rises a volcano and deep crater lake steeped in symbolism. Mount Paektu, an active stratovolcano straddling the border of North Korea and China, is the highest peak on the Korean peninsula and lies at the heart of North Korea’s foundation myth. The North Korean side of the mountain was recently designated a UNESCO Global Geopark, marking North Korea’s first natural site ",
        "source": "CNN"
    },
    {
        "title": "World’s tallest bridge",
        "link": "https://edition.cnn.com/2025/04/15/travel/huajiang-grand-canyon-bridge-china-intl-hnk/index.html",
        "content": "Move over, Golden Gate and Sydney Harbour. China is set to open the world’s tallest bridge in June, the latest feat of engineering from the infrastructure-focused country. The Huajiang Grand Canyon Bridge is currently nearing the end of construction in Guizhou, southwest China. It will measure 2,051 feet above river level, which is 947 feet taller than current bridge title holder the Millau Viaduct in France. Guizhou province is a mountainous areas of China, with complex terrain. The bridge cros",
        "source": "CNN"
    },
    {
        "title": "Raffaella Scuotto sbotta sui social: \"Potrò anche avere le corna, voi siete messe peggio\"",
        "link": "https://serial.everyeye.it/notizie/raffaella-scuotto-sbotta-social-potro-corna-messe-peggio-793138.html",
        "content": "La giovane ex corteggiatrice di Brando Ephrikian, con cui sarebbe tuttora fidanzata, ha lanciato una stoccata a chi diffonde false news!L’ex corteggiatrice di Uomini e Donne Raffaella Scuotto si è lasciata andare ad un lungo sfogo sui social, accusando alcuni…",
        "source": "Everyeye.it"
    },
    {
        "title": "The Piano star Mika was told his music was ‘too gay’ by ‘brazen’ industry homophobes",
        "link": "https://www.thepinknews.com/2025/04/14/mika-gay-homphobia/",
        "content": "The Piano judge Mika has opened up about being told his music was “too gay” as he dealt with homophobia in the early years of his career. The “Grace Kelly” singer erupted onto the music scene back in 2007, but his ambiguous sexuality almost overshadowed his t…",
        "source": "Thepinknews.com"
    },
    {
        "title": "Fry hails 'David and Goliath' Wembley win for Posh",
        "link": "https://www.bbc.com/news/articles/cql6er679yro",
        "content": "Posh icon Barry Fry promises himself a day off work on Monday after his side's EFL Trophy triumph.",
        "source": "BBC News"
    },
    {
        "title": "Rory McIlroy’s Grand Slam win: Media reaction around the world",
        "link": "https://www.irishtimes.com/sport/golf/2025/04/14/rory-mcilroys-grand-slam-win-media-reaction-around-the-world/",
        "content": "Masters 2025: Northern Ireland’s Rory McIlroy wins at Augusta after beating Justin Rose in playoff",
        "source": "The Irish Times"
    },
    {
        "title": "Terra and Turnberry to Begin Construction of Grand Hyatt Miami Beach with $392 Million in Financing from TYKO Capital",
        "link": "https://www.hospitalitynet.org/announcement/41012433.html",
        "content": "Terra and Turnberry, two of South Florida's leading real estate development firms, have secured $392 million in construction financing that will help advance the development of Grand Hyatt Miami Beach, an 800-room, 17-story property adjacent to the Miami Beac…",
        "source": "Hospitality Net"
    },
    {
        "title": "Russia-Ukraine war",
        "link": "https://edition.cnn.com/2025/04/14/europe/ukraine-sumy-trump-russia-intl/index.html",
        "content": "“I was told they made a mistake.” This is the way US President Donald Trump characterized Russia’s “horrific” double-tap missile strike on central Sumy, Ukraine, on Saturday, which allegedly used cluster munitions to maximize casualties. The Iskander missiles reportedly utilized are accurate, and the use of two of them could suggest a degree of purpose and malice, aimed at hitting first responders too as they rush in. It is unlikely the Kremlin saw the error of its ways - this tactic being now s",
        "source": "CNN"
    },
    {
        "title": "Trump’s tariffs",
        "link": "https://edition.cnn.com/2025/04/14/business/pharmaceuticals-probe-chip-imports-tariffs/index.html",
        "content": "Markets Fear & Greed Index Latest Market News The Trump administration is kicking off investigations into imports of pharmaceuticals and semiconductors as part of a bid to impose tariffs on both sectors on national security grounds, notices posted to the Federal Register on Monday showed. The filings set to be published on Wednesday set a 21-day deadline from that date for the submission of public comment on the issue and indicate the administration intends to pursue the levies under authority g",
        "source": "CNN"
    },
    {
        "title": "World’s busiest airports",
        "link": "https://edition.cnn.com/2025/04/14/travel/worlds-busiest-airports-passengers-2024/index.html",
        "content": "Air traffic is officially back. In 2024, global passenger numbers finally surpassed 2019 levels, after years of ripples from the massive disruption caused by the Covid-19 pandemic. There were about 9.5 billion passengers globally last year — a 3.8% gain from pre-pandemic levels in 2019 and a 9% increase over 2023, according to preliminary global airport data released on Monday by Airports Council International (ACI) World. ACI represents the interests of 2,181 airports in 170 countries. “We’re v",
        "source": "CNN"
    },
    {
        "title": "The dangers of yawning",
        "link": "https://edition.cnn.com/2025/04/14/health/sleepiness-dangers-wellness/index.html",
        "content": "Sign up for CNN’s Sleep, But Better newsletter series. Our seven-part guide has helpful hints to achieve better sleep. Find yourself yawning a lot? Do you need that third or fourth cup of coffee to make it through the afternoon at work? Such signs of sleepiness may be a red flag of a serious sleep deficit that could put you in physical danger and harm your long-term health, according to a new position paper by the American Academy of Sleep Medicine. “Sleepiness is a serious health concern with w",
        "source": "CNN"
    },
    {
        "title": "‘The Breakfast Club’ reunion",
        "link": "https://edition.cnn.com/2025/04/14/entertainment/breakfast-club-cast-reunion-intl-scli/index.html",
        "content": "The cast of “The Breakfast Club” reunited over the weekend for the first time in 40 years. Stars of the 1980s coming-of-age movie took to the stage at the Chicago Comic and Entertainment Expo on Saturday. “I feel really, very emotional and moved to have us all together,” said Molly Ringwald, who played Claire in the movie. “This is the first time that Emilio (Estèvez) has joined us. We don’t have to use the cardboard cut-out anymore.” Estèvez, who played Andrew, said joining the reunion was “som",
        "source": "CNN"
    },
    {
        "title": "Zelensky urges Trump to visit Ukraine ahead of deal with Russia",
        "link": "https://www.bbc.com/news/articles/c0r5vlwj4dqo",
        "content": "Ukraine's President Volodymyr Zelensky has invited Donald Trump to visit his country ahead of any deal with Russia to end the war. \"Please, before any kind of decisions, any kind of forms of negotiations, come to see people, civilians, warriors, hospitals, churches, children destroyed or dead,\" Zelensky said in an interview for CBS's 60 Minutes programme. The interview was recorded before a Russian missile hit the city of Sumy, killing 34 people and injuring 117 others. Russia has not commented.",
        "source": "BBC"
    },
    {
        "title": "Relatives charged after boy killed in Australia shooting accident",
        "link": "https://www.bbc.com/news/articles/c2kv1ln8qwko",
        "content": "Two people, including a teenager, were arrested after the nine-year-old was shot on a farm on Sunday.",
        "source": "BBC"
    },
    {
        "title": "Landmark antitrust trial could force Zuckerberg to sell Instagram",
        "link": "https://www.bbc.com/news/articles/cedy2ygy50do",
        "content": "A trial in the landmark antitrust case against social media giant Meta kicks off in Washington on Monday. The US competition and consumer watchdog alleges that Meta, which already owned Facebook, bought Instagram in 2012 and WhatsApp in 2014 to eliminate competition, effectively giving itself a monopoly. The FTC reviewed and approved those acquisitions but committed to monitor the outcomes. If the Federal Trade Commission (FTC) wins the case it could force Meta CEO Mark Zuckerberg to sell off bo",
        "source": "BBC"
    },
    {
        "title": "BBC visits scene of destruction in Sumy after Russian attack",
        "link": "https://www.bbc.com/news/videos/c4g28ynge7ro",
        "content": "At least 34 people have been killed and 117 injured in a Russian attack on the city of Sumy, according to Ukrainian authorities. Two ballistic missiles struck the city, with the second causing the most casualties when it exploded over a street, officials said. Ukrainian authorities told the BBC that 20 buildings were damaged, including cafes, shops and five apartment buildings. The BBC's James Waterhouse reports from the scene of the strike. Pope Francis visits St Peter's Basilica in the Vatican",
        "source": "BBC"
    },
    {
        "title": "Gaza medic missing since deadly attack being detained by Israel, Red Cross says",
        "link": "https://www.bbc.com/news/articles/cjdx24v83k3o",
        "content": "A Palestinian paramedic who has been missing since an Israeli attack that killed 15 other emergency workers in southern Gaza three weeks ago is being detained by Israeli authorities, the International Committee of the Red Cross has said. The ICRC confirmed in a statement that it had \"received information\" that Palestine Red Crescent Society (PRCS) medic Assad al-Nassasra was being held \"in an Israeli place of detention\". The PRCS said Mr Nassasra was \"forcibly abducted\" by Israeli troops followi",
        "source": "BBC"
    },
    {
        "title": "His memories uncovered a secret jail - right next to an international airport",
        "link": "https://www.bbc.com/news/articles/cly6lp567r8o",
        "content": "When investigators smashed through a hastily built wall, they uncovered a set of secret jail cells. It turned out to be a freshly bricked-up doorway – an attempt to hide what lurked behind. Inside, off a narrow hallway, were tiny rooms to the right and left. It was pitch-black. The team may never have found this clandestine jail – a stone's throw from Dhaka's International Airport – without the recollections of Mir Ahmad Bin Quasem and others. A critic of Bangladesh's ousted leader, he was held ",
        "source": "BBC"
    },
    {
        "title": "US pastor kidnapped during church service in South Africa found after shoot-out",
        "link": "https://www.bbc.com/news/articles/cj9ez20mgvdo",
        "content": "An American pastor who was kidnapped by armed men during a church service in South Africa last week has been rescued following a \"high-intensity shoot-out\" that left three people dead, police say. Josh Sullivan was found unharmed in the township in Gqeberha in the Eastern Cape on Tuesday evening - the area where the 45-year-old was snatched from last Thursday. There were no immediate details on the kidnappers who are suspected of having been familiar with the family's movements. Over the past de",
        "source": "BBC"
    },
    {
        "title": "Harvard just stood up to Trump. How long can it last?",
        "link": "https://www.bbc.com/news/articles/c20z60vxvmjo",
        "content": "Harvard University says it will not acquiesce to US President Donald Trump's demands - federal funding or no. \"No government - regardless of which party is in power - should dictate what private universities can teach,\" Harvard's president Alan Garber said in a letter posted on the university's website. Not long after Harvard refused to agree to the White House's sweeping list of demands - which included directions on how to govern, hire and teach - the Trump administration froze $2.2bn (£1.7bn)",
        "source": "BBC"
    },
    {
        "title": "China appoints new trade envoy in face of tariff turmoil",
        "link": "https://www.bbc.com/news/articles/c8jem097l4do",
        "content": "China has unexpectedly appointed a new trade envoy, as officials said the US's practice of \"tariff barriers and trade bullying\" is having a serious impact on the global economic order. Li Chenggang, a former assistant commerce minister and WTO ambassador, is taking over from veteran trade negotiator Vice Commerce Minister Wang Shouwen. The shift comes as Beijing refuses to back down in an escalating trade war with Washington triggered by US President Donald Trump's hefty tariffs on Chinese goods",
        "source": "BBC"
    },
    {
        "title": "India's Gandhis charged in money laundering case amid opposition outcry",
        "link": "https://www.bbc.com/news/articles/c4g3qx12r7go",
        "content": "India's opposition Congress party has said it will organise nationwide protests on Wednesday after the country's financial crimes agency charged senior leaders Sonia and Rahul Gandhi and others with money laundering. The Enforcement Directorate (ED) presented its findings in a Delhi court on Tuesday, accusing the Gandhis of forming a shell company to illegally acquire assets of the National Herald newspaper worth more than 20bn rupees ($233mn; £176mn). Congress spokesperson Jairam Ramesh called ",
        "source": "BBC"
    },
    {
        "title": "UK Supreme Court backs 'biological' definition of woman",
        "link": "https://www.bbc.com/news/articles/cvg7pqzk47zo",
        "content": "The UK Supreme Court has unanimously backed the biological definition of \"woman\" under the 2010 Equality Act. It marks the culmination of a long-running legal battle which could have major implications for how sex-based rights apply across Scotland, England and Wales. Judges sided with campaign group For Women Scotland, which brought a case against the Scottish government arguing that sex-based protections should only apply to people that are born female. Judge Lord Hodge said the ruling should ",
        "source": "BBC"
    },
    {
        "title": "His memories uncovered a secret jail - right next to an international airport",
        "link": "https://www.bbc.com/news/articles/cly6lp567r8o",
        "content": "Six men in Bangladesh tell the BBC about how they were forced into detention under the now-deposed government.",
        "source": "BBC"
    },
    {
        "title": "German doctor charged with murder of 15 patients",
        "link": "https://www.bbc.com/news/articles/cly161m6yj1o",
        "content": "A German palliative care doctor has been charged with murdering 15 of his patients using a cocktail of lethal drugs. Prosecutors in Berlin have accused the 40-year-old of setting fire to the homes of some of his suspected victims to cover his tracks. He allegedly killed 12 women and three men between September 2021 and July 2024, though prosecutors have said they believe that total could rise. The doctor, who has not been named due to strict privacy laws in Germany, has not admitted to the charg",
        "source": "BBC"
    },
    {
        "title": "Harvard just stood up to Trump. How long can it last?",
        "link": "https://www.bbc.com/news/articles/c20z60vxvmjo",
        "content": "Harvard University says it will not acquiesce to US President Donald Trump's demands - federal funding or no. \"No government - regardless of which party is in power - should dictate what private universities can teach,\" Harvard's president Alan Garber said in a letter posted on the university's website. Not long after Harvard refused to agree to the White House's sweeping list of demands - which included directions on how to govern, hire and teach - the Trump administration froze $2.2bn (£1.7bn)",
        "source": "BBC"
    },
    {
        "title": "China appoints new trade envoy in face of tariff turmoil",
        "link": "https://www.bbc.com/news/articles/c8jem097l4do",
        "content": "China has unexpectedly appointed a new trade envoy, as officials said the US's practice of \"tariff barriers and trade bullying\" is having a serious impact on the global economic order. Li Chenggang, a former assistant commerce minister and WTO ambassador, is taking over from veteran trade negotiator Vice Commerce Minister Wang Shouwen. The shift comes as Beijing refuses to back down in an escalating trade war with Washington triggered by US President Donald Trump's hefty tariffs on Chinese goods",
        "source": "BBC"
    },
    {
        "title": "India's Gandhis charged in money laundering case amid opposition outcry",
        "link": "https://www.bbc.com/news/articles/c4g3qx12r7go",
        "content": "India's opposition Congress party has said it will organise nationwide protests on Wednesday after the country's financial crimes agency charged senior leaders Sonia and Rahul Gandhi and others with money laundering. The Enforcement Directorate (ED) presented its findings in a Delhi court on Tuesday, accusing the Gandhis of forming a shell company to illegally acquire assets of the National Herald newspaper worth more than 20bn rupees ($233mn; £176mn). Congress spokesperson Jairam Ramesh called ",
        "source": "BBC"
    },
    {
        "title": "Trump's chips strategy: The US will struggle to take on Asia",
        "link": "https://www.bbc.com/news/articles/cd9ljwgg9y0o",
        "content": "Listen to this article The US has \"dropped the ball\" on chip manufacturing over the years, allowing China and other Asian hubs to steam ahead. So said Gina Raimondo, who at the time was the US Commerce Secretary, in an interview with me back in 2021. Four years on, chips remain a battleground in the US-China race for tech supremacy, and US President Donald Trump now wants to turbocharge a highly complex and delicate manufacturing process that has taken other regions decades to perfect. He says h",
        "source": "BBC"
    },
    {
        "title": "'This is so hard': The Chinese small businesses brought to a standstill by Trump's tariffs",
        "link": "https://www.bbc.com/news/articles/c05ne2vmd3po",
        "content": "\"Trump is a crazy man,\" says Lionel Xu, who is surrounded by his company's mosquito repellent kits – many were once best sellers in Walmart stores in the United States. Now those products are sitting in boxes in a warehouse in China and will remain there unless President Donald Trump lifts his 145% tariffs on all Chinese goods bound for the US. \"This is so hard for us,\" he adds. Around half of all products made by his company Sorbo Technology are sold to the US. It is a small company by Chinese ",
        "source": "BBC"
    },
    {
        "title": "Watch: New speed climbing record set in the Swiss Alps",
        "link": "https://www.bbc.com/news/videos/c3r8vx1y8eno",
        "content": "A Swiss and Austrian climbing pair have shattered the speed record for completing the daunting north faces of a famed trio of Swiss mountains - the Eiger, Mönch and Jungfrau. Switzerland's Nicolas Hojac and Austria's Philipp Brugger shaved nearly ten hours off the previous record set more than two decades ago. Footage shows moment missile lands in Ukrainian city of Sumy Pope Francis visits St Peter's Basilica in the Vatican, still with an oxygen tube, as he continues to recover from ill health. ",
        "source": "BBC"
    },
    {
        "title": "Biden attacks Trump in first speech since leaving White House",
        "link": "https://www.bbc.com/news/articles/cj9ez1g8mkdo",
        "content": "Joe Biden has used his first speech since leaving office to criticise the Trump administration's welfare policies. The ex-US president told a conference in Chicago that the government had \"taken a hatchet\" the social security system, which Donald Trump and Elon Musk - who is leading the White House's cost-cutting efforts - claim is beset by fraud. The administration wants to cut staff at the agency responsible for spending $1.6 trillion (£1.2 trillion) in benefits a year. Biden did not refer to ",
        "source": "BBC"
    },
    {
        "title": "Ukraine may have to give up land for peace - Kyiv Mayor Klitschko",
        "link": "https://www.bbc.com/news/articles/cp348ygjgy3o",
        "content": "The mayor of Kyiv, Vitali Klitschko, has told the BBC that Ukraine may have to give up land as part of a peace deal with Russia, amid a growing pressure from President Donald Trump to accept territorial concessions. \"One of the scenarios is… to give up territory. It's not fair. But for the peace, temporary peace, maybe it can be a solution, temporary,\" he said. But the 53-year-old former boxing champion-turned politician stressed that the Ukrainian people would \"never accept occupation\" by Russi",
        "source": "BBC"
    },
    {
        "title": "Will Elon Musk really leave Doge and what happens when he does?",
        "link": "https://www.bbc.com/news/articles/c1dr6k6rvl7o",
        "content": "The Tesla boss says he will step back from government work - but exactly when and how is unclear.",
        "source": "BBC"
    },
    {
        "title": "China shares rare Moon rocks with US despite trade war",
        "link": "https://www.bbc.com/news/articles/cp8v691qmg5o",
        "content": "China will let scientists from six countries, including the US, examine the rocks it collected from the Moon - a scientific collaboration that comes as the two countries remain locked in a bitter trade war. Two Nasa-funded US institutions have been granted access to the lunar samples collected by the Chang'e-5 mission in 2020, the China National Space Administration (CNSA) said on Thursday. CNSA chief Shan Zhongde said that the samples were \"a shared treasure for all humanity,\" local media repor",
        "source": "BBC"
    },
    {
        "title": "Can India really stop river water from flowing into Pakistan?",
        "link": "https://www.bbc.com/news/articles/cd7vjyezypqo",
        "content": "Will India be able to stop the Indus river and two of its tributaries from flowing into Pakistan? That's the question on many minds, after India suspended a major treaty governing water sharing of six rivers in the Indus basin between the two countries, following Tuesday's horrific attack in Indian-administered Kashmir. The 1960 Indus Waters Treaty (IWT) survived two wars between the nuclear rivals and was seen as an example of trans-boundary water management. The suspension is among several ste",
        "source": "BBC"
    },
    {
        "title": "California passes Japan as fourth largest economy",
        "link": "https://www.bbc.com/news/articles/cly80zlk1lyo",
        "content": "California's economy has overtaken that of the country of Japan, making the US state the fourth largest global economic force. Governor Gavin Newsom touted new data from the International Monetary Fund (IMF) and the US Bureau of Economic Analysis showing California's growth. The data shows California's gross domestic product (GDP) hit $4.10 trillion (£3.08 trillion) in 2024, surpassing Japan, which was marked at $4.01 trillion. The state now only trails Germany, China and the US as a whole. \"Cal",
        "source": "BBC"
    },
    {
        "title": "China has halted rare earth exports, can Australia step up?",
        "link": "https://www.bbc.com/news/articles/c86je4vyg36o",
        "content": "Australia's prime minister Anthony Albanese has pledged to invest A$1.2bn (£580m) in a strategic reserve for critical minerals if he wins next month's election, as trade tensions escalate. The announcement came after China imposed export restrictions on seven rare earth elements, essential to the production of advanced technologies - including electric vehicles, fighter jets, and robots. China's controls apply to all countries but were widely seen as retaliation to US President Donald Trump's ta",
        "source": "BBC"
    },
    {
        "title": "TikTok astrologer arrested for predicting new Myanmar quake",
        "link": "https://www.bbc.com/news/articles/c1jx7n3jee9o",
        "content": "Myanmar authorities have arrested an astrologer for causing panic by predicting a new earthquake in a viral TikTok video. John Moe The posted his prediction on 9 April, just two weeks after a magnitude 7.7 earthquake killed 3,500 people and destroyed centuries-old temples in the South East Asian nation. He was arrested Tuesday for making \"false statements with the intention of causing public panic\", Myanmar's information ministry said. John Moe The had warned that an earthquake would \"hit every ",
        "source": "BBC"
    },
    {
        "title": "'Very, very toxic': The risk of asbestos in Gaza's rubble",
        "link": "https://www.bbc.com/news/articles/ce8y4j91l83o",
        "content": "Israel's destructive military campaign in Gaza has released a silent killer: asbestos. The mineral, once widely-used in building materials, releases toxic fibres into the air when disturbed that can cling to the lungs and - over decades - cause cancer. Nowadays, its use is banned across much of the world, but it is still present in many older buildings. In Gaza, it is found primarily in asbestos roofing used across the territory's eight urban refugee camps - which were set up for Palestinians wh",
        "source": "BBC"
    },
    {
        "title": "Applause heard as Zelensky arrives for funeral",
        "link": "https://www.bbc.com/news/videos/c0r52gxqd55o",
        "content": "Applause was heard as Ukrainian President Volodymyr Zelensky arrived for the Pope's funeral in St Peter's Square. President Zelensky was among dozens of leaders and dignitaries - including Donald Trump and Prince William - who joined 40,000 mourners in St Peter's Square. Follow live updates The most important date in the Christian calendar is being marked around the world. It is unclear if Ukraine has accepted the terms or already discussed the plans for the pause in fighting with Russia. A look",
        "source": "BBC"
    },
    {
        "title": "US President Trump pays respects by Pope's coffin",
        "link": "https://www.bbc.com/news/videos/cvg8zwpq786o",
        "content": "US President Donald Trump and his wife Melania took a moment to pause and reflect by the coffin of Pope Francis ahead of his funeral. Thousands of mourners, among them royalty and politicians, have gathered for the event. Follow live updates New York family describe paying their respects to Pope Francis as a \"once-in-a-lifetime opportunity\". The most important date in the Christian calendar is being marked around the world. It is unclear if Ukraine has accepted the terms or already discussed the",
        "source": "BBC"
    },
    {
        "title": "What to look out for at the funeral",
        "link": "https://www.bbc.com/news/articles/cq5w9yzy1vpo",
        "content": "The funeral of Pope Francis will be simpler than those of previous popes, following instructions he set out himself. But as a head of state and leader of more than a billion Catholics worldwide, it will still be a spectacle of ceremony and tradition. His death has drawn famous figures, politicians, and thousands of followers to Vatican City to pay their respects. Archbishops and bishops started gathering at 08:30 local time (07:30 BST) in the Constantine Wing, a corridor adjacent to St Peter's B",
        "source": "BBC"
    },
    {
        "title": "Zelensky and Trump meet before funeral",
        "link": "https://www.bbc.com/news/articles/ce8gpdj704mo",
        "content": "The two leaders held talks ahead of attending the service in Vatican City on Saturday.",
        "source": "BBC"
    },
    {
        "title": "Who is there and where are they sitting?",
        "link": "https://www.bbc.com/news/articles/c5y6rg6wpvgo",
        "content": "Numerous world leaders and royals have gathered in Rome for Pope Francis' funeral. Among the most prominent figures at the Vatican's St Peter's Square on Saturday morning are Prince William, US President Donald Trump and his predecessor Joe Biden, Britain's Prime Minister Sir Keir Starmer and French President Emmanuel Macron. Their attendance comes at a fragile time for international diplomacy, with Trump meeting Ukraine's President Volodymyr Zelensky before the service, according to Zelensky's ",
        "source": "BBC"
    },
    {
        "title": "Virginia Giuffre, Prince Andrew and Jeffrey Epstein accuser, dies by suicide",
        "link": "https://www.bbc.com/news/articles/cql67qk0dd3o",
        "content": "Virginia Giuffre, who accused Prince Andrew and Jeffrey Epstein of sexual abuse, has died by suicide aged 41, her family has said. Ms Giuffre was one of the most outspoken accusers of convicted sex offenders Epstein and Ghislaine Maxwell, his former girlfriend. She alleged they trafficked her to the Duke of York when she was 17, which Prince Andrew has strenuously denied. Relatives said in a statement on Friday that she had been a \"fierce warrior in the fight against sexual abuse\", and that the ",
        "source": "BBC"
    },
    {
        "title": "Russia and Ukraine 'very close to a deal', says Trump",
        "link": "https://www.bbc.com/news/articles/c9dj4402qejo",
        "content": "US President Donald Trump has said Russia and Ukraine \"are very close to a deal\", hours after his envoy Steve Witkoff and Russian President Vladimir Putin held talks in Moscow. Trump said it had been a \"good day\" of negotiations, while the Kremlin described the talks - which Ukraine was not present at - as \"constructive\". Earlier, Trump said on social media that \"most of the major points are agreed to,\" and urged Russia and Ukraine to meet \"at very high levels\" and \"to finish it [the deal] off\".",
        "source": "BBC"
    },
    {
        "title": "US judge arrested for allowing undocumented man to escape immigration agents",
        "link": "https://www.bbc.com/news/articles/cly5xx017vko",
        "content": "Federal agents arrested a Wisconsin judge and charged her with obstruction for allegedly trying to help an undocumented immigrant evade arrest. Announcing her arrest, FBI director Kash Patel accused Milwaukee County Circuit Judge Hannah Dugan of \"intentionally misdirecting\" immigration agents away from a Mexican man they were trying to arrest last week. \"Thankfully our agents chased down the perp on foot and he's been in custody since, but the Judge's obstruction created increased danger to the ",
        "source": "BBC"
    },
    {
        "title": "Trump administration reverses termination of visas for foreign students",
        "link": "https://www.bbc.com/news/articles/cgm8ekk173zo",
        "content": "The Trump administration is restoring visas for hundreds of foreign students who had their legal status abruptly terminated stoking panic among many who feared immediate deportation, government officials confirmed. Justice department attorney Elizabeth Kurlan told a federal court that immigration officials are now working on a new system for reviewing and terminating visas for international students. The announcement follows more than 100 lawsuits filed by students who were abruptly stripped of ",
        "source": "BBC"
    }
]