[
    {
        "title": "UK Supreme Court backs 'biological' definition of woman",
        "link": "https://www.bbc.com/news/articles/cvg7pqzk47zo",
        "content": "The UK Supreme Court has unanimously backed the biological definition of \"woman\" under the 2010 Equality Act. It marks the culmination of a long-running legal battle which could have major implications for how sex-based rights apply across Scotland, England and Wales. Judges sided with campaign group For Women Scotland, which brought a case against the Scottish government arguing that sex-based protections should only apply to people that are born female. Judge Lord Hodge said the ruling should ",
        "source": "BBC"
    },
    {
        "title": "His memories uncovered a secret jail - right next to an international airport",
        "link": "https://www.bbc.com/news/articles/cly6lp567r8o",
        "content": "Six men in Bangladesh tell the BBC about how they were forced into detention under the now-deposed government.",
        "source": "BBC"
    },
    {
        "title": "German doctor charged with murder of 15 patients",
        "link": "https://www.bbc.com/news/articles/cly161m6yj1o",
        "content": "A German palliative care doctor has been charged with murdering 15 of his patients using a cocktail of lethal drugs. Prosecutors in Berlin have accused the 40-year-old of setting fire to the homes of some of his suspected victims to cover his tracks. He allegedly killed 12 women and three men between September 2021 and July 2024, though prosecutors have said they believe that total could rise. The doctor, who has not been named due to strict privacy laws in Germany, has not admitted to the charg",
        "source": "BBC"
    },
    {
        "title": "Harvard just stood up to Trump. How long can it last?",
        "link": "https://www.bbc.com/news/articles/c20z60vxvmjo",
        "content": "Harvard University says it will not acquiesce to US President Donald Trump's demands - federal funding or no. \"No government - regardless of which party is in power - should dictate what private universities can teach,\" Harvard's president Alan Garber said in a letter posted on the university's website. Not long after Harvard refused to agree to the White House's sweeping list of demands - which included directions on how to govern, hire and teach - the Trump administration froze $2.2bn (£1.7bn)",
        "source": "BBC"
    },
    {
        "title": "China appoints new trade envoy in face of tariff turmoil",
        "link": "https://www.bbc.com/news/articles/c8jem097l4do",
        "content": "China has unexpectedly appointed a new trade envoy, as officials said the US's practice of \"tariff barriers and trade bullying\" is having a serious impact on the global economic order. Li Chenggang, a former assistant commerce minister and WTO ambassador, is taking over from veteran trade negotiator Vice Commerce Minister Wang Shouwen. The shift comes as Beijing refuses to back down in an escalating trade war with Washington triggered by US President Donald Trump's hefty tariffs on Chinese goods",
        "source": "BBC"
    },
    {
        "title": "India's Gandhis charged in money laundering case amid opposition outcry",
        "link": "https://www.bbc.com/news/articles/c4g3qx12r7go",
        "content": "India's opposition Congress party has said it will organise nationwide protests on Wednesday after the country's financial crimes agency charged senior leaders Sonia and Rahul Gandhi and others with money laundering. The Enforcement Directorate (ED) presented its findings in a Delhi court on Tuesday, accusing the Gandhis of forming a shell company to illegally acquire assets of the National Herald newspaper worth more than 20bn rupees ($233mn; £176mn). Congress spokesperson Jairam Ramesh called ",
        "source": "BBC"
    },
    {
        "title": "Trump's chips strategy: The US will struggle to take on Asia",
        "link": "https://www.bbc.com/news/articles/cd9ljwgg9y0o",
        "content": "Listen to this article The US has \"dropped the ball\" on chip manufacturing over the years, allowing China and other Asian hubs to steam ahead. So said Gina Raimondo, who at the time was the US Commerce Secretary, in an interview with me back in 2021. Four years on, chips remain a battleground in the US-China race for tech supremacy, and US President Donald Trump now wants to turbocharge a highly complex and delicate manufacturing process that has taken other regions decades to perfect. He says h",
        "source": "BBC"
    },
    {
        "title": "'This is so hard': The Chinese small businesses brought to a standstill by Trump's tariffs",
        "link": "https://www.bbc.com/news/articles/c05ne2vmd3po",
        "content": "\"Trump is a crazy man,\" says Lionel Xu, who is surrounded by his company's mosquito repellent kits – many were once best sellers in Walmart stores in the United States. Now those products are sitting in boxes in a warehouse in China and will remain there unless President Donald Trump lifts his 145% tariffs on all Chinese goods bound for the US. \"This is so hard for us,\" he adds. Around half of all products made by his company Sorbo Technology are sold to the US. It is a small company by Chinese ",
        "source": "BBC"
    },
    {
        "title": "Watch: New speed climbing record set in the Swiss Alps",
        "link": "https://www.bbc.com/news/videos/c3r8vx1y8eno",
        "content": "A Swiss and Austrian climbing pair have shattered the speed record for completing the daunting north faces of a famed trio of Swiss mountains - the Eiger, Mönch and Jungfrau. Switzerland's Nicolas Hojac and Austria's Philipp Brugger shaved nearly ten hours off the previous record set more than two decades ago. Footage shows moment missile lands in Ukrainian city of Sumy Pope Francis visits St Peter's Basilica in the Vatican, still with an oxygen tube, as he continues to recover from ill health. ",
        "source": "BBC"
    },
    {
        "title": "Biden attacks Trump in first speech since leaving White House",
        "link": "https://www.bbc.com/news/articles/cj9ez1g8mkdo",
        "content": "Joe Biden has used his first speech since leaving office to criticise the Trump administration's welfare policies. The ex-US president told a conference in Chicago that the government had \"taken a hatchet\" the social security system, which Donald Trump and Elon Musk - who is leading the White House's cost-cutting efforts - claim is beset by fraud. The administration wants to cut staff at the agency responsible for spending $1.6 trillion (£1.2 trillion) in benefits a year. Biden did not refer to ",
        "source": "BBC"
    }
]