[
    {
        "title": "Applause heard as Zelensky arrives for funeral",
        "link": "https://www.bbc.com/news/videos/c0r52gxqd55o",
        "content": "Applause was heard as Ukrainian President Volodymyr Zelensky arrived for the Pope's funeral in St Peter's Square. President Zelensky was among dozens of leaders and dignitaries - including Donald Trump and Prince William - who joined 40,000 mourners in St Peter's Square. Follow live updates The most important date in the Christian calendar is being marked around the world. It is unclear if Ukraine has accepted the terms or already discussed the plans for the pause in fighting with Russia. A look",
        "source": "BBC"
    },
    {
        "title": "US President Trump pays respects by Pope's coffin",
        "link": "https://www.bbc.com/news/videos/cvg8zwpq786o",
        "content": "US President Donald Trump and his wife Melania took a moment to pause and reflect by the coffin of Pope Francis ahead of his funeral. Thousands of mourners, among them royalty and politicians, have gathered for the event. Follow live updates New York family describe paying their respects to Pope Francis as a \"once-in-a-lifetime opportunity\". The most important date in the Christian calendar is being marked around the world. It is unclear if Ukraine has accepted the terms or already discussed the",
        "source": "BBC"
    },
    {
        "title": "What to look out for at the funeral",
        "link": "https://www.bbc.com/news/articles/cq5w9yzy1vpo",
        "content": "The funeral of Pope Francis will be simpler than those of previous popes, following instructions he set out himself. But as a head of state and leader of more than a billion Catholics worldwide, it will still be a spectacle of ceremony and tradition. His death has drawn famous figures, politicians, and thousands of followers to Vatican City to pay their respects. Archbishops and bishops started gathering at 08:30 local time (07:30 BST) in the Constantine Wing, a corridor adjacent to St Peter's B",
        "source": "BBC"
    },
    {
        "title": "Zelensky and Trump meet before funeral",
        "link": "https://www.bbc.com/news/articles/ce8gpdj704mo",
        "content": "The two leaders held talks ahead of attending the service in Vatican City on Saturday.",
        "source": "BBC"
    },
    {
        "title": "Who is there and where are they sitting?",
        "link": "https://www.bbc.com/news/articles/c5y6rg6wpvgo",
        "content": "Numerous world leaders and royals have gathered in Rome for Pope Francis' funeral. Among the most prominent figures at the Vatican's St Peter's Square on Saturday morning are Prince William, US President Donald Trump and his predecessor Joe Biden, Britain's Prime Minister Sir Keir Starmer and French President Emmanuel Macron. Their attendance comes at a fragile time for international diplomacy, with Trump meeting Ukraine's President Volodymyr Zelensky before the service, according to Zelensky's ",
        "source": "BBC"
    },
    {
        "title": "Virginia Giuffre, Prince Andrew and Jeffrey Epstein accuser, dies by suicide",
        "link": "https://www.bbc.com/news/articles/cql67qk0dd3o",
        "content": "Virginia Giuffre, who accused Prince Andrew and Jeffrey Epstein of sexual abuse, has died by suicide aged 41, her family has said. Ms Giuffre was one of the most outspoken accusers of convicted sex offenders Epstein and Ghislaine Maxwell, his former girlfriend. She alleged they trafficked her to the Duke of York when she was 17, which Prince Andrew has strenuously denied. Relatives said in a statement on Friday that she had been a \"fierce warrior in the fight against sexual abuse\", and that the ",
        "source": "BBC"
    },
    {
        "title": "Russia and Ukraine 'very close to a deal', says Trump",
        "link": "https://www.bbc.com/news/articles/c9dj4402qejo",
        "content": "US President Donald Trump has said Russia and Ukraine \"are very close to a deal\", hours after his envoy Steve Witkoff and Russian President Vladimir Putin held talks in Moscow. Trump said it had been a \"good day\" of negotiations, while the Kremlin described the talks - which Ukraine was not present at - as \"constructive\". Earlier, Trump said on social media that \"most of the major points are agreed to,\" and urged Russia and Ukraine to meet \"at very high levels\" and \"to finish it [the deal] off\".",
        "source": "BBC"
    },
    {
        "title": "US judge arrested for allowing undocumented man to escape immigration agents",
        "link": "https://www.bbc.com/news/articles/cly5xx017vko",
        "content": "Federal agents arrested a Wisconsin judge and charged her with obstruction for allegedly trying to help an undocumented immigrant evade arrest. Announcing her arrest, FBI director Kash Patel accused Milwaukee County Circuit Judge Hannah Dugan of \"intentionally misdirecting\" immigration agents away from a Mexican man they were trying to arrest last week. \"Thankfully our agents chased down the perp on foot and he's been in custody since, but the Judge's obstruction created increased danger to the ",
        "source": "BBC"
    },
    {
        "title": "Trump administration reverses termination of visas for foreign students",
        "link": "https://www.bbc.com/news/articles/cgm8ekk173zo",
        "content": "The Trump administration is restoring visas for hundreds of foreign students who had their legal status abruptly terminated stoking panic among many who feared immediate deportation, government officials confirmed. Justice department attorney Elizabeth Kurlan told a federal court that immigration officials are now working on a new system for reviewing and terminating visas for international students. The announcement follows more than 100 lawsuits filed by students who were abruptly stripped of ",
        "source": "BBC"
    }
]