[
    {
        "title": "Ousted Russian general",
        "link": "https://edition.cnn.com/2025/04/15/europe/ousted-russian-general-ivan-popov-return-intl/index.html",
        "content": "One of Russia’s most outspoken generals, sacked and detained after a withering attack on the Defense Ministry two years ago, is returning to the front, according to his lawyer. But according to Russian state media, he’s been handed a poisoned chalice: front-line command of a notorious battalion of ex-prisoners that has suffered massive casualties in Ukraine. Two years ago, Major General Ivan Popov was the decorated commander of the 58th Combined Arms Army in southern Ukraine, receiving plaudits ",
        "source": "CNN"
    },
    {
        "title": "‘Historic’ WHO agreement",
        "link": "https://edition.cnn.com/2025/04/15/health/world-health-organization-pandemic-agreement-intl-hnk/index.html",
        "content": "Members of the World Health Organization reached an agreement to prepare the world for future pandemics after more than three years of negotiations, the organization said early on Wednesday. The legally binding pact is intended to shore up the world’s defenses against new pathogens after the COVID-19 pandemic killed millions of people in 2020-22. The proposal outlines measures to prevent future pandemics and strengthen global collaboration. This includes establishing a pathogen access and benefi",
        "source": "CNN"
    },
    {
        "title": "Pakistan and India heatwaves",
        "link": "https://edition.cnn.com/2025/04/15/asia/india-pakistan-heatwave-climate-crisis-intl-hnk/index.html",
        "content": "For hundreds of millions of people living in India and Pakistan the early arrival of summer heatwaves has become a terrifying reality that’s testing survivability limits and putting enormous strain on energy supplies, vital crops and livelihoods. Both countries experience heatwaves during the summer months of May and June, but this year’s heatwave season has arrived sooner than usual and is predicted to last longer too. Temperatures are expected to climb to dangerous levels in both countries thi",
        "source": "CNN"
    },
    {
        "title": "UNESCO Global Geopark",
        "link": "https://edition.cnn.com/2025/04/15/travel/north-korea-mount-paektu-unesco-geopark-intl-hnk/index.html",
        "content": "High atop the Korean Peninsula, past military checkpoints and bumpy dirt roads in one of the world’s most secretive countries, rises a volcano and deep crater lake steeped in symbolism. Mount Paektu, an active stratovolcano straddling the border of North Korea and China, is the highest peak on the Korean peninsula and lies at the heart of North Korea’s foundation myth. The North Korean side of the mountain was recently designated a UNESCO Global Geopark, marking North Korea’s first natural site ",
        "source": "CNN"
    },
    {
        "title": "World’s tallest bridge",
        "link": "https://edition.cnn.com/2025/04/15/travel/huajiang-grand-canyon-bridge-china-intl-hnk/index.html",
        "content": "Move over, Golden Gate and Sydney Harbour. China is set to open the world’s tallest bridge in June, the latest feat of engineering from the infrastructure-focused country. The Huajiang Grand Canyon Bridge is currently nearing the end of construction in Guizhou, southwest China. It will measure 2,051 feet above river level, which is 947 feet taller than current bridge title holder the Millau Viaduct in France. Guizhou province is a mountainous areas of China, with complex terrain. The bridge cros",
        "source": "CNN"
    },
    {
        "title": "Lenny Kravitz’s mansion",
        "link": "https://edition.cnn.com/2025/04/15/style/lenny-kravitz-paris-home-architectural-digest/index.html",
        "content": "There are a few constants that the Internet knows about Lenny Kravitz’s lifestyle. Photos of him wearing an enormous brown blanket scarf, which resurface each year, have become a reliable indicator of the approaching winter. And he’s never far from a pair of leather pants, which the 60-year-old American musician proved last year when he posted a video to TikTok bench pressing while doing sit-ups at the gym in black leather, a sheer mesh tank and sunglasses. (“This isn’t how everyone’s dad works ",
        "source": "CNN"
    },
    {
        "title": "Xi’s powerful card in fight against Trump’s trade war",
        "link": "https://edition.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Less than a year into Donald Trump’s first trade war with China, Chinese leader Xi Jinping made a high-profile visit to an unassuming factory in Ganzhou, an industrial city nestled among rolling hills in the country’s southeast. Touring its exhibition hall in 2019, Xi examined row upon row of unremarkable gray metal blocks and declared to his entourage of Communist Party officials: “Rare earths are a vital strategic resource.” Nearly six years on, Ch",
        "source": "CNN"
    },
    {
        "title": "China’s export restrictions on seven types of rare earth minerals is bad news for America’s cutting edge industries. And Trump has little room to retaliate in kind.",
        "link": "https://edition.cnn.com/2025/04/15/business/china-trumps-trade-war-rare-earth-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Less than a year into Donald Trump’s first trade war with China, Chinese leader Xi Jinping made a high-profile visit to an unassuming factory in Ganzhou, an industrial city nestled among rolling hills in the country’s southeast. Touring its exhibition hall in 2019, Xi examined row upon row of unremarkable gray metal blocks and declared to his entourage of Communist Party officials: “Rare earths are a vital strategic resource.” Nearly six years on, Ch",
        "source": "CNN"
    },
    {
        "title": "Hong Kong suspends postal service to the US after Trump’s tariff hikes",
        "link": "https://edition.cnn.com/2025/04/15/business/hong-kong-suspends-postal-service-to-us-intl-hnk/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Hong Kong’s postal service will stop handling packages coming from or going to the United States, in the latest retaliatory move amid an escalating trade war between Washington and Beijing. In a statement published Wednesday announcing the decision, the government of Hong Kong cited US President Donald Trump’s decision last week to eliminate the so-called de minimis exception for items posted from the city to the US. The exemption applied to internat",
        "source": "CNN"
    },
    {
        "title": "Trump’s trade war is wrecking America’s brand value, from Teslas to Treasuries",
        "link": "https://edition.cnn.com/2025/04/16/business/america-brand-trade-war/index.html",
        "content": "Markets Fear & Greed Index Latest Market News Editor’s Note: A version of this story appeared in CNN Business’ Nightcap newsletter. To get it in your inbox, sign up for free here. This is all pretty embarrassing. It’s been two weeks since President Donald Trump’s “Liberation Day” tariff speech launched a global trade war, premised on absurd math, and erased trillions of dollars in market value. Every day since has been a stream of contradictory statements and brinkmanship with no way of knowing ",
        "source": "CNN"
    }
]