[
    {
        "title": "Dead rodents found on Gene Hackman’s property by health department investigators",
        "link": "https://www.wbrc.com/2025/04/15/dead-rodents-found-gene-hackmans-property-by-health-department-investigators/",
        "content": "Hackman's wife died from hantavirus, a rare disease caused by exposure to rodents, before her husband died, according to a medical examiner's report.",
        "source": "WBRC"
    },
    {
        "title": "Trump különmegbízottja szerint „már alakul” az orosz-ukrán béke",
        "link": "https://hvg.hu/vilag/20250415_Trump-kulonmegbizottja-szerint-mar-alakul-az-orosz-ukran-beke",
        "content": "Steve Witkoff a múlt héten öt órán át tárgyalt Putyinnal, most elmondott pár dolgot a találkozóról.",
        "source": "Hvg.hu"
    },
    {
        "title": "Call of Duty 2025: Wenn dieses Feature zurückkommt, kaufe ich den Shooter zum Release",
        "link": "https://www.giga.de/entertainment/call-of-duty-2025-wenn-dieses-feature-zurueckkommt-kaufe-ich-den-shooter-zum-release--01JRWFSG5VDAXF4FHD8YCKM27H",
        "content": "Erste Gerüchte zum diesjährigen Call of Duty machen die Runde im Netz. Darunter befindet sich auch ein Feature, das ich schmerzlich vermisse: eine Koop-Kampagne. Sollte diese Mechanik dieses Jahr tatsächlich ein Comeback feiern, dann wäre ich direkt zum Relea…",
        "source": "Giga"
    },
    {
        "title": "JD Vance trolled with jokes that Trump’s tariffs ‘will lead to the soaring price of eyeliner’",
        "link": "https://www.thepinknews.com/2025/04/15/jd-vance-eyeliner-tariffs-donald-trump/",
        "content": "Vice-president JD Vance has once again become the butt of jokes over his alleged use of eyeliner, and this time its related to the thorny issue of Trump’s controversial tariffs. Now, we don’t take issue with anyone for their apparent use of make up, but if yo…",
        "source": "Thepinknews.com"
    },
    {
        "title": "Mr. Drew and His Animals, Too searching for new location. Again.",
        "link": "https://www.sunjournal.com/2025/04/14/mr-drew-and-his-animals-too-searching-for-new-location-again/",
        "content": "Drew Desjardins, owner of the business, announced Monday that he has been told that he needs to leave his spacious spot at the Lewiston Mall by the end of July.",
        "source": "Lewiston Sun Journal"
    },
    {
        "title": "Integration Tests for Plugin Developers: GitHub Actions and Setting Up Continuous Integration",
        "link": "https://blog.jetbrains.com/platform/2025/04/integration-tests-for-plugin-developers-github-actions-and-setting-up-continuous-integration/",
        "content": "In our previous blog posts, we created integration tests that interact with UI components, assert different properties of UI components, and interact with APIs. Now, it’s time to look at how to set up continuous integration to ensure that we don’t break them …",
        "source": "Jetbrains.com"
    },
    {
        "title": "Taste Atlas: Δύο ελληνικές σαλάτες οι καλύτερες στον κόσμο",
        "link": "https://www.skai.gr/news/gastronomy/taste-atlas-dyo-ellinikes-salates-oi-kalyteres-ston-kosmo",
        "content": "Στη δεύτερη θέση δεν θα μπορούσε να είναι άλλη σαλάτα εκτός από τη χωριάτικη - Στην 50άδα είναι και τα χόρτα αλλά και η πατατοσαλάτα",
        "source": "Skai.gr"
    },
    {
        "title": "‘The Race’ rapper Tay-K convicted of murder for the second time",
        "link": "https://nypost.com/2025/04/15/us-news/rapper-tay-k-convicted-of-murder-for-shooting-photographer-while-fleeing-another-murder/",
        "content": "The rapper is best known for his hit track \"The Race,\" which has amassed hundreds of millions of streams since its release in 2017.",
        "source": "New York Post"
    },
    {
        "title": "‘Just So F*cking Weird!’ Jon Stewart Rips Trump’s ‘Embarrassingly Sycophantic’ Cabinet Members",
        "link": "https://www.mediaite.com/tv/just-so-fcking-weird-jon-stewart-rips-trumps-embarrassingly-sycophantic-cabinet-members/",
        "content": "The Daily Show host Jon Stewart ridiculed President Donald Trump's \"sycophantic\" cabinet members, calling their constant compliments \"just so f*cking weird.\"\nThe post ‘Just So F*cking Weird!’ Jon Stewart Rips Trump’s ‘Embarrassingly Sycophantic’ Cabinet Membe…",
        "source": "Mediaite"
    },
    {
        "title": "Stanley Cup playoff watch: Your guide to the 10 games on Tuesday's schedule",
        "link": "https://www.espn.com/nhl/story/_/id/44673023/nhl-playoffs-bracket-standings-2025-wild-card-bracket-games-matchups",
        "content": "Here's what is at stake in each matchup, with playoff seeding and draft lottery position on the line.",
        "source": "ESPN"
    }
]