[
    {
        "title": "Elon Musk Comes Up Short",
        "link": "https://politicalwire.com/2025/04/25/elon-musk-comes-up-short/",
        "content": "“President Trump and Elon Musk promised taxpayers big savings, maybe even a ‘DOGE dividend’ check in their mailboxes, when the Department of Government Efficiency was let loose on the federal government. Now, as he prepares",
        "source": "Politicalwire.com"
    },
    {
        "title": "¿Cuán beneficiosos son realmente los cereales para nuestra salud?",
        "link": "https://www.bbc.com/mundo/articles/cn4w8jdgymyo",
        "content": "Los cereales de desayuno fortificados pueden ser una fuente útil de fibra, vitaminas y minerales, pero algunos se consideran alimentos ultraprocesados.",
        "source": "BBC News"
    },
    {
        "title": "Serviciul de securitate al Rusiei susține că a reținut un român care spiona pentru Ucraina și a publicat imagini cu momentul arestării. Îl acuză că transmitea informații despre instalațiile de apărare aeriană din orașul Soci, din Krasnodar.",
        "link": "https://www.biziday.ro/317427-2/",
        "content": "‼️ A #Romanian citizen who was collecting information about the deployment of #Russian air defense systems on assignment from Kiev has been detained in Sochi, the FSB reported. pic.twitter.com/mVAlJ6RgIM — Maimunka News (@MaimunkaNews) April 25, 2025 …",
        "source": "Biziday.ro"
    },
    {
        "title": "Tesla stock: are volume and sentiment bottoming together?",
        "link": "https://biztoc.com/x/0a520b5693784128",
        "content": "The Entire Business World on a Single Page with the Web's Most Comprehensive One-Stop Finance News Hub.",
        "source": "Biztoc.com"
    },
    {
        "title": "Szalenie ważne dni dla Wisły Kraków. Wiele się wyjaśni",
        "link": "https://sport.interia.pl/pilka-nozna/1-liga/news-szalenie-wazne-dni-dla-wisly-krakow-wiele-sie-wyjasni,nId,7954931",
        "content": "Wisła Kraków rozpoczyna serię kluczowych spotkań. Jeśli podtrzyma passę zwycięstw, zbliży się do Ekstraklasy. Z kolei straty punktów mogą okazać się bardzo bolesne. Dziś pierwszy z meczów - na wyjeździe z wiceliderem Bruk-Bet Termalica Nieciecza (godz. 20:30).",
        "source": "Interia.pl"
    },
    {
        "title": "Penn Badgley shares why he dropped ‘no sex scenes’ clause for final season of You: ‘Had to return to form’",
        "link": "https://www.the-independent.com/arts-entertainment/tv/news/penn-badgley-dropped-no-sex-scenes-clause-final-season-you-b2739328.html",
        "content": "Actor previously said he had requested a reduction in number of sex scenes",
        "source": "The-independent.com"
    },
    {
        "title": "Premier League injury news, predicted lineups, fantasy updates",
        "link": "https://www.espn.com/soccer/story/_/id/44848083/premier-league-injury-news-chelsea-man-united-liverpool-predicted-xis",
        "content": "Find out who is missing through injury and who is in a race against time to prove their fitness in the Premier League this weekend.",
        "source": "ESPN"
    },
    {
        "title": "Apple's new iPhone 16 ad encourages you to go case-free – here’s why that’s still a bad idea",
        "link": "https://www.techradar.com/phones/iphone/apples-new-iphone-16-ad-encourages-you-to-go-case-free-heres-why-thats-still-a-bad-idea",
        "content": "Apple's latest promo ad shows an iPhone 16 being dropped to the floor, but surviving without a scratch.",
        "source": "TechRadar"
    },
    {
        "title": "What is VE day and how will the King and Queen celebrate it?",
        "link": "https://www.the-independent.com/news/uk/home-news/ve-day-king-charles-queen-camilla-victory-europe-b2739364.html",
        "content": "VE day events will start on Bank Holiday Monday with a procession of 1,300 members of the Armed Forces",
        "source": "The-independent.com"
    },
    {
        "title": "Wybuch tuż pod Moskwą. Media: Nie żyje rosyjski generał",
        "link": "https://wydarzenia.interia.pl/zagranica/news-wybuch-tuz-pod-moskwa-media-nie-zyje-rosyjski-general,nId,21397739",
        "content": "Zastępca szefa Głównego Zarządu Operacyjnego Sztabu Generalnego Sił Zbrojnych Rosji gen. Jarosław Moskalik nie żyje - podają media. Wojskowy miał zginąć w eksplozji zaparkowanego na podwórzu samochodu w mieście Bałaszycha, w obwodzie moskiewskim. Nieoficjalne…",
        "source": "Interia.pl"
    }
]